# 07练习
# 这章代码实在太多，笔记、练习分开
# 全是大师级案例，记一遍，默写一遍！

# 测试区

# 列表的索引还可以用逻辑值
print([1,2][True]) # 2
print([1,2][False]) # 1

# 练习1：在屏幕上显示跑马灯文字。





# 练习2：设计一个函数产生指定长度的验证码，验证码由大小写字母和数字构成。





# 练习3：设计一个函数返回给定文件名的后缀名。





# 练习4：设计一个函数返回传入的列表中最大和第二大的元素的值。






# 练习5：计算指定的年月日是这一年的第几天。






# 练习6：打印[杨辉三角](https://zh.wikipedia.org/wiki/%E6%9D%A8%E8%BE%89%E4%B8%89%E8%A7%92%E5%BD%A2)。




# 综合案例

# 案例1：双色球选号。

# 综合案例2：[约瑟夫环问题](https://zh.wikipedia.org/wiki/%E7%BA%A6%E7%91%9F%E5%A4%AB%E6%96%AF%E9%97%AE%E9%A2%98)。

# 综合案例3：[井字棋](https://zh.wikipedia.org/wiki/%E4%BA%95%E5%AD%97%E6%A3%8B)游戏。